Documents/ПередатьДела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПередатьДела</Name>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСотрудника</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СотрудникиПринимающие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПередаваемыеТипы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипСотрудника</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПередатьДела/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПодборВтаблЧасть(Результат)
	Об = РеквизитФормыВЗначение("Объект");		
	РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Об.Объекты, Результат);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьСервер();
КонецПроцедуры

&НаСервере
Процедура РаспределитьСервер()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаДО.Объект,
	                      |	ТаблицаДО.Сотрудник
	                      |ПОМЕСТИТЬ ТаблицаДО
	                      |ИЗ
	                      |	&ТаблицаДО КАК ТаблицаДО
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаДО.Объект,
	                      |	МАКСИМУМ(ТаблицаДО.Сотрудник) КАК Сотрудник
	                      |ПОМЕСТИТЬ ТаблицаДОБезПовт
	                      |ИЗ
	                      |	ТаблицаДО КАК ТаблицаДО
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТаблицаДО.Объект
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ТаблицаС.Сотрудник
	                      |ПОМЕСТИТЬ ТаблицаС
	                      |ИЗ
	                      |	&ТаблицаС КАК ТаблицаС
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаС.Сотрудник,
	                      |	ЕСТЬNULL(Таблица.Количество, 0) КАК Количество
	                      |ИЗ
	                      |	ТаблицаС КАК ТаблицаС
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ТаблицаДОБезПовт.Сотрудник КАК Сотрудник,
	                      |			КОЛИЧЕСТВО(*) КАК Количество
	                      |		ИЗ
	                      |			ТаблицаДОБезПовт КАК ТаблицаДОБезПовт
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ТаблицаДОБезПовт.Сотрудник) КАК Таблица
	                      |		ПО ТаблицаС.Сотрудник = Таблица.Сотрудник
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаДОБезПовт.Объект,
	                      |	ТаблицаДОБезПовт.Сотрудник
	                      |ИЗ
	                      |	ТаблицаДОБезПовт КАК ТаблицаДОБезПовт");
	Запрос.УстановитьПараметр("ТаблицаДО", Объект.Объекты.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаС", Объект.СотрудникиПринимающие.Выгрузить());
	Результат = Запрос.ВыполнитьПакет();
	КоличествоДел.Загрузить(Результат[3].Выгрузить());
	Объект.Объекты.Загрузить(Результат[4].Выгрузить());					  
	
	Для Каждого Элемент Из Объект.Объекты Цикл
		Если Элемент.Сотрудник.Пустая() Тогда
			КоличествоДел.Сортировать("Количество");
			Элемент.Сотрудник = КоличествоДел[0].Сотрудник;
			КоличествоДел[0].Количество = КоличествоДел[0].Количество + 1;
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДО.Объект,
	               |	ТаблицаДО.Сотрудник
	               |ПОМЕСТИТЬ ТаблицаДО
	               |ИЗ
	               |	&ТаблицаДО КАК ТаблицаДО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДО.Объект,
	               |	ОтветственныеСотрудники.ТипСотрудника,
	               |	ТаблицаДО.Сотрудник
	               |ИЗ
	               |	ТаблицаДО КАК ТаблицаДО
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	               |		ПО ТаблицаДО.Объект = ОтветственныеСотрудники.Объект
	               |			И (ОтветственныеСотрудники.Пользователь = &Пользователь)
	               |			И (ОтветственныеСотрудники.ТипСотрудника В (&СписокТипыС))";
	Запрос.УстановитьПараметр("ТаблицаДО", Объект.Объекты.Выгрузить());
	Запрос.УстановитьПараметр("Пользователь", Объект.Ответственный);
	Запрос.УстановитьПараметр("СписокТипыС", Объект.ПередаваемыеТипы.Выгрузить().ВыгрузитьКолонку("ТипСотрудника"));
	Объект.Объекты.Загрузить(Запрос.Выполнить().Выгрузить());
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)	
	Для Каждого Элемент Из Объект.Объекты Цикл
		Элемент.Сотрудник = Неопределено;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.ОбъектыОбъект.ВыбиратьТип = (Элементы.Объекты.ТекущиеДанные.Объект = Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры
